A=[1,2,43,6,56,78]
#Действия со списками:
#A. append("1")#добавляет элемент в конец списка
#A.clear()#удаляет все элементы из списка 
#A.сору()#создает копию последовательности
#A.count(1)#подсчитывает количество вхождений элемента в списке и возвращает найденое значение
#print(A. index("3"))#выводит индекс элемента списка 
#A. insert(1, "23")#добавляет элемент в определенное место
#print(A.pop(2))#выводит удаление элемента по его индексу
#A.remove("5")#удаляет элемент
#A.reverse()#реберсирует список
#A.sort()#сортирует список
#Вывод первого и последнго значения введеной строки:
print(A, ) 
print(A[0],A[-1])
